Ran Plan for project: `dev` dir: `terraform/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # null_resource.example will be created
+ resource "null_resource" "example" {
      + id = (known after apply)
    }

  # module.erouska.google_cloud_scheduler_job.efgsdownkeys-worker will be created
+ resource "google_cloud_scheduler_job" "efgsdownkeys-worker" {
      + attempt_deadline = "600s"
      + id               = (known after apply)
      + name             = "efgsdownkeys-worker"
      + project          = (known after apply)
      + region           = "europe-west1"
      + schedule         = "*/15 * * * *"
      + time_zone        = "Europe/Prague"

      + http_target {
          + http_method = "GET"

          + oidc_token {
              + service_account_email = (known after apply)
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 1
        }
    }

  # module.erouska.google_project_iam_member.efgsdownkeys-invoker[0] will be created
+ resource "google_project_iam_member" "efgsdownkeys-invoker" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/cloudfunctions.serviceAgent"
    }

  # module.erouska.google_project_iam_member.efgsdownkeys-invoker[1] will be created
+ resource "google_project_iam_member" "efgsdownkeys-invoker" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/iam.serviceAccountUser"
    }

  # module.erouska.google_project_iam_member.efgsdownloadkeys[2] will be created
+ resource "google_project_iam_member" "efgsdownloadkeys" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:efgs-download-keys@erouska-key-server-dev.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/redis.editor"
    }

  # module.erouska.google_project_iam_member.efgsdownloadkeys[3] will be created
+ resource "google_project_iam_member" "efgsdownloadkeys" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:efgs-download-keys@erouska-key-server-dev.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/pubsub.publisher"
    }

  # module.erouska.google_project_iam_member.efgsimportkeys[0] will be created
+ resource "google_project_iam_member" "efgsimportkeys" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/cloudfunctions.serviceAgent"
    }

  # module.erouska.google_project_iam_member.efgsimportkeys[1] will be created
+ resource "google_project_iam_member" "efgsimportkeys" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.erouska.google_pubsub_topic.efgs-download-keys will be destroyed
- resource "google_pubsub_topic" "efgs-download-keys" {
      - id      = "projects/erouska-key-server-dev/topics/efgs-download-keys" -> null
      - labels  = {} -> null
      - name    = "efgs-download-keys" -> null
      - project = "erouska-key-server-dev" -> null
    }

  # module.erouska.google_pubsub_topic.efgs-import-keys will be created
+ resource "google_pubsub_topic" "efgs-import-keys" {
      + id      = (known after apply)
      + name    = "efgs-import-keys"
      + project = (known after apply)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }
    }

  # module.erouska.google_service_account.efgsdownkeys-invoker will be created
+ resource "google_service_account" "efgsdownkeys-invoker" {
      + account_id   = "efgsdownkeys-invoker-sa"
      + display_name = "EfgsDownloadKeys invoker"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.erouska.google_service_account.efgsimportkeys will be created
+ resource "google_service_account" "efgsimportkeys" {
      + account_id   = "efgs-import-keys"
      + display_name = "EfgsImportKeys cloud function service account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

Plan: 11 to add, 0 to change, 1 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p dev`
* :put_litter_in_its_place: To **delete** this plan click [here](https://146.148.76.137/lock?id=covid19cz%252Ferouska-backend%252Fterraform%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p dev`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
